app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (category_id = '2') ORDER BY created_at desc LIMIT 0, 15
SELECT count(*) AS count_all FROM `articles` WHERE (category_id = 'unknow')
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `articles` WHERE (`articles`.`id` = 4)
---
  def index
    @articles = Article.paginate(:all,:page=>params[:page],:order=>"created_at desc",:per_page=>15,:conditions=>["category_id = ?",params[:category_id]])
    @category = "unknow"
    @categories = Category.find(:all)
    @lastest = Article.find(:all,:limit=>15,:order=>"created_at desc")

SELECT * FROM `articles` WHERE (`articles`.`permalink` = 'zhe-hui-ke-yi-shi-zhong-wen-le-ba') LIMIT 1
UPDATE `articles` SET `visited_count` = 1, `updated_at` = '2009-02-26 13:38:49' WHERE `id` = 1
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `articles` WHERE (`articles`.`id` = 0)
SELECT * FROM `articles` ORDER BY created_at desc LIMIT 10
SELECT * FROM `comments` WHERE (article_id = '4') ORDER BY created_at desc LIMIT 0, 25
SELECT count(*) AS count_all FROM `comments` WHERE (article_id = '4')
---
  def show
    @article = Article.find_by_permalink(params[:permalink])
    if @article
      @article.increment!(:visited_count, 1)
      @categories = Category.find(:all)
      @lastest = Article.find(:all,:limit=>10,:order=>"created_at desc")
      @comments = Comment.paginate(:all,:page=>params[:page],:order=>"created_at desc",:per_page=>25,:conditions=>["article_id = ?",@article])

SELECT * FROM `articles` WHERE (`articles`.`id` = 7)
---
  def new
    @article = Article.new
    @category = "unknow"
    @categories = Category.find(:all)
    @lastest = Article.find(:all,:limit=>10,:order=>"created_at desc")

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`permalink`, `updated_at`, `title`, `visited_count`, `category_id`, `content`, `comments_count`, `user_id`, `created_at`) VALUES(NULL, '2009-03-03 15:01:13', '看看永久链接', 0, 1, '啊哈哈~', 0, 1, '2009-03-03 15:01:13')
---
  def create
    @article = Article.new(params[:article])
    @article.user_id = session[:user].id
    permlink = PinYin.instance
    @article.permalink = permlink.to_permlink(@article.title)

    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `title` = '小小12哈', `permalink` = 'xiao-xiao-12', `updated_at` = '2009-03-03 21:46:22' WHERE `id` = 8
---
  def update
    @article = Article.find(params[:id])
    permlink = PinYin.instance.to_permlink(params[:article][:title])

    respond_to do |format|
      if @article.update_attributes(:title=>params[:article][:title],:content=>params[:article][:content],:permalink=>permlink)

DELETE FROM `articles` WHERE `id` = 2
DELETE FROM `comments` WHERE (article_id = 2)
SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
---
  def destroy
    Comment.delete_all("article_id = #{params[:id]}")
    Article.find(params[:id]).destroy