app/controllers/categories_controller.rb

SELECT * FROM `articles` WHERE (`articles`.`id` = 8)
---
  def new
    @category = Category.new
    @categories = Category.find(:all)
    @lastest = Article.find(:all,:limit=>10,:order=>"created_at desc")

INSERT INTO `categories` (`name`, `updated_at`, `articles_count`, `created_at`) VALUES('测试类别', '2009-02-26 11:51:05', NULL, '2009-02-26 11:51:05')
---
  def create
    @category = Category.new(params[:category])


    if @category.save

DELETE FROM `articles` WHERE (category_id = 2)
DELETE FROM `categories` WHERE `id` = 2
DELETE FROM `comments` WHERE (article_id = 6)
SELECT * FROM `articles` WHERE (`articles`.`category_id` = '2') LIMIT 1
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
---
  def destroy
    Article.find(:all,:conditions=>["category_id = ?",params[:id]]).each { |i| Comment.delete_all("article_id = #{i.id}") }
    Article.delete_all("category_id = #{params[:id]}")
    @category = Category.find(params[:id])