app/controllers/comments_controller.rb

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def create
    @comment = Comment.new(params[:comment])
    @comment.article_id = params[:article_id]

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`updated_at`, `title`, `content`, `article_id`, `user_name`, `created_at`) VALUES('2009-02-27 09:16:45', NULL, NULL, 4, NULL, '2009-02-27 09:16:45')

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
DELETE FROM `comments` WHERE `id` = 1