app/controllers/home_controller.rb

SELECT * FROM `articles` ORDER BY created_at desc LIMIT 0, 15
SELECT count(*) AS count_all FROM `articles`
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
SELECT * FROM `articles` WHERE (`articles`.`id` = 4)
---
  def index
    @articles = Article.paginate(:all,:page=>params[:page],:order=>"created_at desc",:per_page=>15)
    @category = "unknow"
    @categories = Category.find(:all)
    @lastest = Article.find(:all,:limit=>10,:order=>"created_at desc")