app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `articles_count`, `created_at`) VALUES('johnnyr', '381631800.421436717322496', '2009-02-26 11:48:51', '49a0fa318c2ddf72f26e9e0620788d6fbb728262', NULL, '2009-02-26 11:48:51')

  def login
    @categories = Category.find(:all)
    @lastest = Article.find(:all,:limit=>10,:order=>"created_at desc")
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 4)